sdaiDeleteSchemaInstance(Sdai_instS*)
\details
Deletes a specified schema instance.
\param schemaInstance [in] A schema instance to be deleted.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiSI_NEXS - Schema instance does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.